lovyan03/LovyanGFX/src/lgfx/v1/platforms/esp32/Bus_HUB75.cpp
/*----------------------------------------------------------------------------/
  Lovyan GFX - Graphics library for embedded devices.

Original Source:
 https://github.com/lovyan03/LovyanGFX/

Licence:
 [FreeBSD](https://github.com/lovyan03/LovyanGFX/blob/master/license.txt)

Author:
 [lovyan03](https://twitter.com/lovyan03)

Contributors:
 [ciniml](https://github.com/ciniml)
 [mongonta0716](https://github.com/mongonta0716)
 [tobozo](https://github.com/tobozo)
/----------------------------------------------------------------------------*/
#if defined (ESP_PLATFORM)
#include <sdkconfig.h>
#if defined (CONFIG_IDF_TARGET_ESP32)

#include "Bus_HUB75.hpp"
#include "../../misc/pixelcopy.hpp"

#include <soc/dport_reg.h>
#include <esp_log.h>

#if defined ( ESP_IDF_VERSION_VAL )
 #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
  #define LGFX_IDF_V5
 #endif
#endif

namespace lgfx
{
 inline namespace v1
 {

  void Bus_HUB75::setImageBuffer(void* buffer, color_depth_t depth)
  {
    _depth = depth;
    auto fb = (DividedFrameBuffer*)buffer;
    _frame_buffer = fb;
    _panel_width = fb->getLineSize() / ((depth & color_depth_t::bit_mask) >> 3);
    _panel_height = fb->getTotalLines();
  }

//----------------------------------------------------------------------------

  static constexpr uint32_t _conf_reg_default = I2S_TX_MSB_RIGHT | I2S_TX_RIGHT_FIRST | I2S_RX_RIGHT_FIRST | I2S_TX_MONO;
  static constexpr uint32_t _conf_reg_start   = _conf_reg_default | I2S_TX_START;
  static constexpr uint32_t _conf_reg_reset   = _conf_reg_default | I2S_TX_RESET;
  static constexpr uint32_t _sample_rate_conf_reg_direct = 16 << I2S_TX_BITS_MOD_S | 16 << I2S_RX_BITS_MOD_S | 1 << I2S_TX_BCK_DIV_NUM_S | 1 << I2S_RX_BCK_DIV_NUM_S;
  static constexpr uint32_t _fifo_conf_default = 1 << I2S_TX_FIFO_MOD | 1 << I2S_RX_FIFO_MOD | 16 << I2S_TX_DATA_NUM_S | 16 << I2S_RX_DATA_NUM_S;
  static constexpr uint32_t _fifo_conf_dma     = _fifo_conf_default | I2S_DSCR_EN;

  static __attribute__ ((always_inline)) inline volatile uint32_t* reg(uint32_t addr) { return (volatile uint32_t *)ETS_UNCACHED_ADDR(addr); }

  __attribute__((always_inline))
  static inline i2s_dev_t* getDev(i2s_port_t port)
  {
#if SOC_I2C_NUM > 1
    return (port == 0) ? &I2S0 : &I2S1;
#else
    return &I2S0;
#endif
  }

  void Bus_HUB75::config(const config_t& cfg)
  {
    _cfg = cfg;
    _dev = getDev(cfg.i2s_port);
  }

  uint32_t Bus_HUB75::calc_dma_buffer_len(uint32_t panel_width, uint32_t panel_height)
  {
    return (((TRANSFER_PERIOD_COUNT + 1) * panel_width) + (2 * panel_height)) * sizeof(uint16_t);
  }

  uint32_t Bus_HUB75::calc_dma_transfer_len(uint32_t panel_width, uint32_t panel_height)
  {
    return (((TRANSFER_PERIOD_COUNT + EXTEND_PERIOD_COUNT) * panel_width) + (2 * panel_height));
  }

  bool Bus_HUB75::init(void)
  {
    auto idx_base = (_cfg.i2s_port == I2S_NUM_0) ? I2S0O_DATA_OUT8_IDX : I2S1O_DATA_OUT8_IDX;

    for (size_t i = 0; i < 14; ++i)
    {
      if (_cfg.pin_data[i] < 0) continue;

#if defined ( LGFX_IDF_V5 )
      esp_rom_gpio_pad_select_gpio(_cfg.pin_data[i]);
      esp_rom_gpio_connect_out_signal(_cfg.pin_data[i  ], idx_base + i, 0, 0);
#else
      gpio_pad_select_gpio(_cfg.pin_data[i]);
      gpio_matrix_out(_cfg.pin_data[i  ], idx_base + i, 0, 0);
#endif
    }

    idx_base = (_cfg.i2s_port == I2S_NUM_0) ? I2S0O_WS_OUT_IDX : I2S1O_WS_OUT_IDX;
#if defined ( LGFX_IDF_V5 )
    esp_rom_gpio_connect_out_signal(_cfg.pin_clk, idx_base, 1, 0); // clock Active-low
#else
    gpio_matrix_out(_cfg.pin_clk, idx_base, 1, 0); // clock Active-low
#endif

    uint32_t dport_clk_en;
    uint32_t dport_rst;

    if (_cfg.i2s_port == I2S_NUM_0) {
      idx_base = I2S0O_WS_OUT_IDX;
      dport_clk_en = DPORT_I2S0_CLK_EN;
      dport_rst = DPORT_I2S0_RST;
    }
#if SOC_I2C_NUM > 1
    else
    {
      idx_base = I2S1O_WS_OUT_IDX;
      dport_clk_en = DPORT_I2S1_CLK_EN;
      dport_rst = DPORT_I2S1_RST;
    }
#endif

    DPORT_SET_PERI_REG_MASK(DPORT_PERIP_CLK_EN_REG, dport_clk_en);
    DPORT_CLEAR_PERI_REG_MASK(DPORT_PERIP_RST_EN_REG, dport_rst);

    auto i2s_dev = (i2s_dev_t*)_dev;
    //Reset I2S subsystem
    i2s_dev->conf.val = I2S_TX_RESET | I2S_RX_RESET | I2S_TX_FIFO_RESET | I2S_RX_FIFO_RESET;
    i2s_dev->conf.val = _conf_reg_default;

    i2s_dev->timing.val = 0;

    //Reset DMA
    i2s_dev->lc_conf.val = I2S_IN_RST | I2S_OUT_RST | I2S_AHBM_RST | I2S_AHBM_FIFO_RST;
    i2s_dev->lc_conf.val = I2S_OUT_EOF_MODE | I2S_OUTDSCR_BURST_EN | I2S_OUT_DATA_BURST_EN;

    i2s_dev->in_link.val = 0;
    i2s_dev->out_link.val = 0;

    i2s_dev->conf1.val = I2S_TX_PCM_BYPASS;
    i2s_dev->conf2.val = I2S_LCD_EN;
    i2s_dev->conf_chan.val = 1 << I2S_TX_CHAN_MOD_S | 1 << I2S_RX_CHAN_MOD_S;

    i2s_dev->int_ena.val = 0;
    i2s_dev->int_clr.val = ~0u;
    i2s_dev->int_ena.out_eof = 1;

/*  // DMAディスクリプタが利用するDMAメモリ位置テーブル
 この配列は、14x2セットのDMAディスクリプタそれぞれが使用するバッファメモリの範囲を表す。
  0 : 無データ,x1点灯
  1 : 輝度1/32データ,無灯
  2 : 輝度1/16データ,1/32点灯
  3 : 輝度1/ 8データ,1/16点灯
  4 : 輝度1/ 4データ,1/8点灯
  5 : 輝度1/ 2データ,1/4点灯
  6 : 輝度 x 1データ,1/2点灯
  7 : 輝度 x 2データ, x1点灯
  8 : 輝度 x 4データ, x1点灯
  9 : SHIFTREG_ABC座標,無灯 (他の期間と比べてデータサイズが小さい。パネルの高さ相当)
*/
    static constexpr const uint8_t dma_buf_idx_tbl[] = {
      9, 1, 2, 3, 4, 5, 6, 7, 0, 8, 0, 0, 0, 0, 
    };

/* DMAディスクリプタの各役割は以下の通り
  [ 0](SHIFTREG_ABC座標転送,無灯期間)
  [ 1](輝度1/32成分データ転送,無灯期間)
  [ 2](輝度1/16成分データ転送,1/32点灯期間)
  [ 3](輝度1/ 8成分データ転送,1/16点灯期間)
  [ 4](輝度1/ 4成分データ転送,1/ 8点灯期間)
  [ 5](輝度1/ 2成分データ転送,1/ 4点灯期間)
  [ 6](輝度1/ 1成分データ転送,1/ 2点灯期間)
  [ 7](輝度  x2成分データ転送,1/ 1点灯期間)
  [ 8](            データ無し,  x1点灯期間)
  [ 9](輝度  x4成分データ転送,  x1点灯期間)
  [10](            データ無し,  x1点灯期間)
  [11](            データ無し,  x1点灯期間)
  [12](            データ無し,  x1点灯期間)
  [13](            データ無し,  x1点灯期間)
  ※ 13番の転送が終わったあとは2セットあるディスクリプタ群の先頭にリンクする。
     また、13番の転送が終わった時点でEOF割込みが起こり、次のラインのデータ生成タスクが実行される。

  ※ 0番 SHIFTREG_ABC座標,無灯の転送期間はパネル１枚の高さに比例、それ以外の期間はパネル全体の幅に比例する

   色深度8を再現するために、同一ラインに輝度成分の異なるデータを8回を送る。
   後半の輝度x2,x4のデータに対しては点灯期間が長いため、x1点灯期間を複数設けることで輝度差を実現する。
   "データ無しx1点灯期間"で送信する内容はすべて同一で良いため、同じメモリ範囲を共有利用してメモリを節約している。
*/

    // (データ転送期間8回 + SHIFTREG_ABC座標期間1回 + 拡張点灯期間5回 = 14) * 2セット分
    if (_dmadesc) heap_caps_free(_dmadesc);
    _dmadesc = (lldesc_t*)heap_caps_malloc(sizeof(lldesc_t) * TOTAL_PERIOD_COUNT * _dma_desc_set, MALLOC_CAP_DMA);

    uint32_t panel_width = _panel_width;

