lovyan03/LovyanGFX/src/lgfx/v1/platforms/esp32/Bus_HUB75.cpp
    // DMA用バッファメモリ確保。 無データ点灯期間1回分 + データ転送期間8回分 + SHIFTREG_ABC座標期間1回 の合計10回分を連続領域として確保する
    // 無データ点灯期間は合計5回あるが、同じ領域を使い回すためバッファは1回分でよい;
    size_t buf_bytes = calc_dma_buffer_len(panel_width, _panel_height);

    for (size_t i = 0; i < _dma_desc_set; i++) {
      _dma_buf[i] = (uint16_t*)heap_alloc_dma(buf_bytes);
      if (_dma_buf[i] == nullptr) {
        ESP_EARLY_LOGE("Bus_HUB75", "memory allocate error.");
      }
      // バッファ初期値として OE(消灯)で埋めておく
      memset(_dma_buf[i], _mask_oe, buf_bytes);

      for (int j = 0; j < TOTAL_PERIOD_COUNT; j++) {
        uint32_t idx = i * TOTAL_PERIOD_COUNT + j;
        size_t bufidx = dma_buf_idx_tbl[j] * panel_width;
        // SHIFTREG_ABCの期間のみデータ長をpanel_height * 2とする
        size_t buflen = ((j == 0) ? _panel_height<<1 : panel_width) * sizeof(uint16_t);
        _dmadesc[idx].buf = (volatile uint8_t*)&(_dma_buf[i][bufidx]);
        _dmadesc[idx].eof = j == (TOTAL_PERIOD_COUNT - 1); // 最後の転送期間のみEOFイベントを発生させる
        _dmadesc[idx].empty = (uint32_t)(&_dmadesc[(idx + 1) % (TOTAL_PERIOD_COUNT * _dma_desc_set)]);
        _dmadesc[idx].owner = 1;
        _dmadesc[idx].length = buflen;
        _dmadesc[idx].size = buflen;
      }
    }
    setBrightness(_brightness);

    return true;
  }

  __attribute__((always_inline))
  static inline uint32_t _gcd(uint32_t a, uint32_t b)
  {
    uint32_t c = a % b;
    while (c != 0) {
      a = b;
      b = c;
      c = a % b;
    }
    return b;
  }

  static uint32_t getClockDivValue(uint32_t targetFreq)
  {
    // ToDo:get from APB clock.
    uint32_t baseClock = 80 * 1000 * 1000;
    uint32_t n = baseClock / targetFreq;
    if (n > 255) { n = 255; }
    uint32_t a = 1;
    uint32_t b = 0;

    // div_nが小さい場合に小数成分を含めると誤動作するのでここ除外する
    if (n > 4)
    {
      uint32_t delta_hz = baseClock - targetFreq * n;
      if (delta_hz) {
        uint32_t gcd = _gcd(targetFreq, delta_hz);
        a = targetFreq / gcd;
        b = delta_hz / gcd;
        uint32_t d = a / 63 + 1;
        a /= d;
        b /= d;
      }
    }

    return       I2S_CLK_EN
          | a << I2S_CLKM_DIV_A_S
          | b << I2S_CLKM_DIV_B_S
          | n << I2S_CLKM_DIV_NUM_S
          ;
  }

  void Bus_HUB75::setBrightness(uint8_t brightness)
  {
// ESP_EARLY_LOGE("DEBUG","brightness:%d", brightness);
    _brightness = brightness;
    int br = brightness + 1;
    auto panel_width = _panel_width;
    uint32_t light_len_limit = (panel_width - 7);
    uint32_t slen = (light_len_limit * br) >> 8;

    _brightness_period[TRANSFER_PERIOD_COUNT] = panel_width;
    for (int period = TRANSFER_PERIOD_COUNT - 1; period >= 0; --period)
    {
      if (period < 5) { slen >>= 1; }
      _brightness_period[period] = slen + 4;
// ESP_EARLY_LOGE("DEBUG","period%d  = %d", period, slen);
    }
  }

  void Bus_HUB75::release(void)
  {
    endTransaction();
    if (_dmadesc)
    {
      heap_caps_free(_dmadesc);
      _dmadesc = nullptr;
    }
    for (int i = 0; i < 2; i++) {
      if (_dma_buf[i])
      {
        heap_free(_dma_buf[i]);
        _dma_buf[i] = nullptr;
      }
    }
  }

  void Bus_HUB75::fm6124_command(uint16_t *buf, uint32_t width, uint8_t brightness)
  {
    // 通信開始時に送信するLEDドライバの輝度設定レジスタ操作データ
    uint8_t fm6124_param_reg[2][16] =
    { { 0, 0, 0, 0, 0, 0x3F, 0x3F, 0x3F, 0x3F, 0x3F, 0x3F,    0, 0, 0, 0, 0 } // REG 11
    , { 0, 0, 0, 0, 0,    0,    0,    0,    0, 0x3F,    0,    0, 0, 0, 0, 0 } // REG 12
    };

    // 輝度設定に合わせて値を変更する
    for (uint8_t bit = 0; bit < 5; ++bit)
    {
      fm6124_param_reg[0][8 - bit] = (brightness & (1 << bit)) ? 0x3F : 0;
    }

    for (size_t j = 0; j < 2; ++j)
    {
      for (size_t i = 0; i < width; ++i)
      { // 正しく反映されない事があるので、2回連続で設定しておく;
        buf[width * (1 + j * 4) + (i ^ 1)] = (uint16_t)(fm6124_param_reg[j][i & 15] | _mask_oe | (i >= (width - (11+j)) ? _mask_lat : 0));
        buf[width * (2 + j * 4) + (i ^ 1)] = (uint16_t)(fm6124_param_reg[j][i & 15] | _mask_oe | (i >= (width - (11+j)) ? _mask_lat : 0));
      }
    }
  }

  void Bus_HUB75::beginTransaction(void)
  {
    if (_dmatask_handle)
    {
      return;
    }

    if (_pixel_tbl)
    {
      heap_free(_pixel_tbl);
    }

    {
      if (_pixel_tbl)
      {
        heap_free(_pixel_tbl);
        _pixel_tbl = nullptr;
      }

      auto bytes = (_depth & color_depth_t::bit_mask) >> 3;
      if (bytes <= 1)
      { // for RGB332
        _pixel_tbl = (uint32_t*)heap_alloc_dma(256 * sizeof(uint32_t));
        for (size_t rgb332 = 0; rgb332 < 256; ++rgb332)
        {
          uint_fast16_t r = 1 + (((rgb332 & 0xE0u) * 0b01001u) >> 5);
          uint_fast16_t g = 1 + (((rgb332 & 0x1Cu) * 0b01001u) >> 2);
          uint_fast16_t b = 1 + (((rgb332 & 0x03u) * 0b10101u)     );
          r = (r * r + 31) >> 7;
          g = (g * g + 31) >> 7;
          b = (b * b + 31) >> 7;
          if (r > 31) { r = 31; }
          if (g > 31) { g = 31; }
          if (b > 31) { b = 31; }

          uint32_t value = 0;
          for (size_t shift = 0; shift < 5; ++shift)
          {
            uint32_t mask = (1 << shift);
            value |= (r & mask) << (shift * 5 + 0)
                  |  (g & mask) << (shift * 5 + 1)
                  |  (b & mask) << (shift * 5 + 2);
          }
          _pixel_tbl[rgb332] = value;
        }
      } else
      {
        bool is565 = (bytes == 2);
        uint32_t size = is565 ? 64 : 256;
        _pixel_tbl = (uint32_t*)heap_alloc_dma(size * sizeof(uint32_t));
        for (size_t i = 0; i < size; ++i)
        {
          uint_fast8_t v = (is565 ? (i * 65) >> 4 : i) + 1;
          v = (v * v) >> 8;
          if (v < i) { v = i; }
          else if (v > 255) { v = 255; }
          uint32_t value = 0;
          for (size_t shift = 0; shift < 8; ++shift)
          {
            uint32_t mask = (1 << shift);
            value |= (v & mask) << (shift * 2 + 2);
          }
          _pixel_tbl[i] = value;
        }
      }
    }

    auto dev = (i2s_dev_t*)_dev;
    dev->out_link.val = 0;
    dev->fifo_conf.val = _fifo_conf_dma;
    dev->sample_rate_conf.val = _sample_rate_conf_reg_direct;

    // 総転送データ量とリフレッシュレートに基づいて送信クロックを設定する
    uint32_t freq_write = (calc_dma_transfer_len(_panel_width, _panel_height) * _panel_height * _cfg.refresh_rate) >> 1;
    dev->clkm_conf.val = getClockDivValue(freq_write);

    dev->conf.val = _conf_reg_reset;
    dev->out_link.val = I2S_OUTLINK_START | ((uint32_t)_dmadesc & I2S_OUTLINK_ADDR);
#if portNUM_PROCESSORS > 1
    if (((size_t)_cfg.task_pinned_core) < portNUM_PROCESSORS)
    {
      xTaskCreatePinnedToCore(dmaTask, "hub75dma", 4096, this, _cfg.task_priority, &_dmatask_handle, _cfg.task_pinned_core);
    }
    else
#endif
    {
      xTaskCreate(dmaTask, "hub75dma", 4096, this, _cfg.task_priority, &_dmatask_handle);
    }
  }

  void Bus_HUB75::endTransaction(void)
  {
    if (_dmatask_handle)
    {
      auto handle = _dmatask_handle;
      _dmatask_handle = nullptr;
      xTaskNotify(handle, 0, eNotifyAction::eSetValueWithOverwrite);
    }

    auto i2s_dev = (i2s_dev_t*)_dev;
    i2s_dev->int_ena.val = 0;
    i2s_dev->int_clr.val = ~0u;
    i2s_dev->out_link.stop = 1;
    i2s_dev->conf.val = _conf_reg_reset;
    i2s_dev->out_link.val = 0;
    if (_pixel_tbl)
    {
      heap_free(_pixel_tbl);
      _pixel_tbl = nullptr;
    }
  }

  void IRAM_ATTR Bus_HUB75::i2s_intr_handler_hub75(void *arg)
  {
    auto me = (Bus_HUB75*)arg;
    auto dev = getDev(me->_cfg.i2s_port);
    auto st = dev->int_st.val;
    bool flg_eof = st & I2S_OUT_EOF_INT_ST;
    dev->int_clr.val = st;
    if (flg_eof)
    {
      auto desc = (lldesc_t*)dev->out_eof_des_addr;
      xTaskNotifyFromISR(me->_dmatask_handle, (uint32_t)desc->buf, eNotifyAction::eSetValueWithOverwrite, nullptr);
      portYIELD_FROM_ISR();
    }
  }

