lovyan03/LovyanGFX/src/lgfx/v1/platforms/esp32/Bus_HUB75.cpp
  void Bus_HUB75::dmaTask(void *arg)
  {
    auto me = (Bus_HUB75*)arg;

    int intr_source = ETS_I2S0_INTR_SOURCE;
#if SOC_I2C_NUM > 1
    if (me->_cfg.i2s_port != I2S_NUM_0)
    {
      intr_source = ETS_I2S1_INTR_SOURCE;
    }
#endif

    intr_handle_t _isr_handle = nullptr;

    if (esp_intr_alloc(intr_source, ESP_INTR_FLAG_LEVEL1 | ESP_INTR_FLAG_IRAM,
        i2s_intr_handler_hub75, me, &(_isr_handle)) != ESP_OK) {
      ESP_EARLY_LOGE("Bus_HUB75","esp_intr_alloc failure ");
      return;
    }

    ESP_EARLY_LOGV("Bus_HUB75","esp_intr_alloc success ");

    auto dev = getDev(me->_cfg.i2s_port);
    dev->conf.val = _conf_reg_start;
    dev->int_clr.val = ~0u;

    // LEDドライバの輝度レジスタ設定
    if (me->_cfg.initialize_mode == config_t::initialize_mode_t::initialize_fm6124)
    {
      auto buf = (uint16_t*)ulTaskNotifyTake( pdTRUE, 32);
      if (buf)
      {
        fm6124_command(buf, me->_panel_width, me->_cfg.fm6124_brightness);

        // 送信完了を待機
        ulTaskNotifyTake(pdTRUE, 32);

        // 送信クロックを下げる
        dev->sample_rate_conf.tx_bck_div_num = 16;

        // 送信完了を待機
        for (int i = 0; i <= _dma_desc_set; ++i)
        {
          auto buf2 = (uint16_t*)ulTaskNotifyTake( pdTRUE, 32);
          if (buf2)
          { // 輝度設定コマンド列をクリア
            memset(buf2, _mask_oe, calc_dma_buffer_len(me->_panel_width, me->_panel_height));
          }
        }

        // 送信クロックを元に戻す
        dev->sample_rate_conf.tx_bck_div_num = 1;
      }
    }

    int bytes = (me->_depth & color_depth_t::bit_mask) >> 3;
    if (bytes < 2)
    {
      me->dmaTask332();
    }
    else
    if (bytes == 2)
    {
      me->dmaTask565();
    }
    // else
    // {
    //   me->dmaTask888();
    // }
    esp_intr_disable(_isr_handle);
    vTaskDelete( nullptr );
  }

  void Bus_HUB75::dmaTask332(void)
  {
    const auto panel_width = _panel_width;
    const auto panel_height = _panel_height;
    const uint32_t len32 = panel_width >> 1;
    uint_fast8_t y = 0;

    const uint16_t* brightness_period = _brightness_period;
    auto pixel_tbl = _pixel_tbl;

    while (_dmatask_handle)
    {
// DEBUG
// lgfx::gpio_lo(15);
      auto dst = (uint32_t*)ulTaskNotifyTake( pdTRUE, portMAX_DELAY);
// DEBUG
// lgfx::gpio_hi(15);
      if (dst == nullptr) { break; }
      auto d32 = dst;

      y = (y + 1) & ((panel_height>>1) - 1);

      uint32_t yy = 0;
      uint32_t yy_oe = _mask_oe | _mask_pin_b_lat;
      if (_cfg.address_mode == config_t::address_mode_t::address_binary)
      {
        yy = y << 8 | y << 24;
        yy_oe = yy | _mask_oe;
      }
      uint32_t yys[] = { yy_oe, yy, yy, yy, yy, yy, yy, yy, yy, };

      auto s_upper = (uint16_t*)(_frame_buffer->getLineBuffer(y));
      auto s_lower = (uint16_t*)(_frame_buffer->getLineBuffer(y + (panel_height>>1)));

      uint_fast8_t light_idx = 0;
      uint32_t x = 0;
      uint32_t xe = brightness_period[0] >> 1;
// lgfx::gpio_lo(15);
      for (;;)
      {
        // RGB332の値を基にガンマテーブルを適用する
        // このテーブルの中身は単にガンマ補正をするだけでなく、
        // BGR順に1ビットずつ並んだ状態に変換する処理を兼ねている。
        uint32_t rgb_upper_1 = *s_upper++;
        uint32_t rgb_lower_1 = *s_lower++;
        uint32_t rgb_upper_2 = rgb_upper_1 >> 8;
        uint32_t rgb_lower_2 = rgb_lower_1 >> 8;

        rgb_upper_1 &= 0xFF;
        rgb_lower_1 &= 0xFF;

        rgb_upper_1 = pixel_tbl[rgb_upper_1];
        rgb_lower_1 = pixel_tbl[rgb_lower_1];
        rgb_upper_2 = pixel_tbl[rgb_upper_2];
        rgb_lower_2 = pixel_tbl[rgb_lower_2];

        // パラレルで同時に送信する6bit分のRGB成分(画面の上半分と下半分)が隣接するように纏める。
        uint32_t rgb_1 = rgb_upper_1 + (rgb_lower_1 << 3);
        uint32_t rgb_2 = rgb_upper_2 + (rgb_lower_2 << 3);

        d32[len32 * 0] = yys[TRANSFER_PERIOD_COUNT - 1];
        d32[len32 * 1] = yys[0];
        d32[len32 * 2] = yys[1];
        d32[len32 * 3] = yys[2];

        int32_t i = 3;
        uint32_t pixel_2 = rgb_2 & 0x3F;
        uint32_t pixel_1 = rgb_1 & 0x3F;
        pixel_2 += yys[i];
        pixel_1 <<= 16;
        d32[++i * len32] = pixel_1 + pixel_2;
        do
        {
          rgb_2 >>= 6;
          rgb_1 >>= 6;
          pixel_2 = rgb_2 & 0x3F;
          pixel_1 = rgb_1 & 0x3F;
          pixel_2 += yys[i];
          pixel_1 <<= 16;
          // 横２列ぶん同時にバッファにセットする
          d32[++i * len32] = pixel_1 + pixel_2;
        } while (i < TRANSFER_PERIOD_COUNT);

        ++d32;

        if (++x < xe) { continue; }
        if (light_idx == TRANSFER_PERIOD_COUNT) break;
        do {
          // PIN B Discharge
          yys[++light_idx] = yy_oe;
          xe = brightness_period[light_idx] >> 1;
        } while (x >= xe);
      }
// lgfx::gpio_hi(15);

      // 無データ,点灯のみの期間の先頭の点灯防止処理
      d32[0 - len32] |= _mask_oe;
      d32[1 - len32] |= (brightness_period[TRANSFER_PERIOD_COUNT-1] & 1) ? (_mask_oe & ~0xFFFF) : _mask_oe;

      d32 += len32;
      // データのラッチ及びラッチ直後の点灯防止処理
      for (int i = 0; i < TRANSFER_PERIOD_COUNT; ++i)
      {
        d32[len32 * i - 1] |= _mask_lat;
        d32[len32 * i + 0] |= _mask_oe;
        d32[len32 * i + 1] |= (brightness_period[i] & 1) ? (_mask_oe & ~0xFFFF) :  _mask_oe;
      }

      d32 += len32 * 7;

      {
      // SHIFTREG_ABCのY座標情報をセット;
        uint32_t poi = (~y) & ((panel_height >> 1) - 1);
        d32[poi                      ] = _mask_pin_a_clk | _mask_oe | _mask_pin_c_dat;
        d32[poi + (panel_height >> 1)] = _mask_pin_a_clk | _mask_oe | _mask_pin_c_dat;
        for (int i = 0; i < _dma_desc_set; ++i)
        {
          poi = (poi + 1) & ((panel_height >> 1) - 1);
          d32[poi                      ] = _mask_pin_a_clk | _mask_oe;
          d32[poi + (panel_height >> 1)] = _mask_pin_a_clk | _mask_oe;
        }
        d32[panel_height - 1] |= _mask_lat | _mask_pin_b_lat;
      }

      // 作画中に次の割込みが発生した場合はビジー状態が続くことを回避するため処理をスキップする
      ulTaskNotifyTake( pdTRUE, 0);
    }
  }

  void IRAM_ATTR Bus_HUB75::dmaTask565(void)
  {
    const auto panel_width = _panel_width;
    const auto panel_height = _panel_height;
    const uint32_t len32 = panel_width >> 1;
    uint_fast8_t y = 0;

