lovyan03/LovyanGFX/src/lgfx/v1/platforms/esp32/Bus_HUB75.cpp
/*
  void Bus_HUB75::dmaTask888(void)
  {
    const auto panel_width = _panel_width;
    const auto panel_height = _panel_height;
    const uint32_t len32 = panel_width >> 1;
    uint_fast8_t y = 0;

    const uint16_t* brightness_period = _brightness_period;
    auto pixel_tbl = _pixel_tbl;

    while (_dmatask_handle)
    {
// DEBUG
// lgfx::gpio_lo(15);
      auto dst = (uint32_t*)ulTaskNotifyTake( pdTRUE, portMAX_DELAY);
// DEBUG
// lgfx::gpio_hi(15);
      if (dst == nullptr) { break; }
      auto d32 = dst;

      y = (y + 1) & ((panel_height>>1) - 1);

      uint32_t yy = 0;
      if (_cfg.address_mode == config_t::address_mode_t::address_binary)
      {
        yy = y << 8 | y << 24;
      }
      uint32_t yys[] = { _mask_pin_a_clk | _mask_oe, yy | _mask_oe, yy, yy, yy, yy, yy, yy, yy, yy, };
      // yy |= _mask_oe;

      auto s_upper = (uint8_t*)(_frame_buffer->getLineBuffer(y));
      auto s_lower = (uint8_t*)(_frame_buffer->getLineBuffer(y + (panel_height>>1)));

      uint_fast8_t light_idx = 0;
      uint32_t x = 0;
      uint32_t xe = brightness_period[1];
      for (;;)
      {
        // RGBそれぞれガンマテーブルを適用する
        // このテーブルの中身は単にガンマ補正をするだけでなく、
        // 各ビットを3bit間隔に変換する処理を兼ねている。
        // 具体的には  0bABCDEFGH  ->  0bA__B__C__D__E__F__G__H_____ のようになる
        uint32_t r_upper_1 = pixel_tbl[*s_upper++];
        uint32_t r_lower_1 = pixel_tbl[*s_lower++];
        uint32_t g_upper_1 = pixel_tbl[*s_upper++];
        uint32_t g_lower_1 = pixel_tbl[*s_lower++];
        uint32_t b_upper_1 = pixel_tbl[*s_upper++];
        uint32_t b_lower_1 = pixel_tbl[*s_lower++];
        uint32_t r_upper_2 = pixel_tbl[*s_upper++];
        uint32_t r_lower_2 = pixel_tbl[*s_lower++];
        uint32_t g_upper_2 = pixel_tbl[*s_upper++];
        uint32_t g_lower_2 = pixel_tbl[*s_lower++];
        uint32_t b_upper_2 = pixel_tbl[*s_upper++];
        uint32_t b_lower_2 = pixel_tbl[*s_lower++];

        // テーブルから取り込んだ値は3bit間隔となっているので、
        // R,G,Bそれぞれが互いを避けるようにビットシフトすることでまとめることができる。
        g_upper_1 += r_upper_1 >> 1;
        g_lower_1 += r_lower_1 >> 1;
        g_upper_2 += r_upper_2 >> 1;
        g_lower_2 += r_lower_2 >> 1;
        uint32_t rgb_upper_1 = b_upper_1 + (g_upper_1 >> 1);
        uint32_t rgb_lower_1 = b_lower_1 + (g_lower_1 >> 1);
        uint32_t rgb_upper_2 = b_upper_2 + (g_upper_2 >> 1);
        uint32_t rgb_lower_2 = b_lower_2 + (g_lower_2 >> 1);

        // 上記の変数の中身は BGRBGRBGRBGR… の順にビットが並んだ状態となる
        // これを、各色の0,2,4,6ビットと1,3,5,7ビットの成分に分離する
        uint32_t rgb_upper_1_even = rgb_upper_1 & 0b00111000111000111000111000111000;
        uint32_t rgb_upper_1_odd  = rgb_upper_1 & 0b11000111000111000111000111000111;
        uint32_t rgb_lower_1_even = rgb_lower_1 & 0b00111000111000111000111000111000;
        uint32_t rgb_lower_1_odd  = rgb_lower_1 & 0b11000111000111000111000111000111;
        uint32_t rgb_upper_2_even = rgb_upper_2 & 0b00111000111000111000111000111000;
        uint32_t rgb_upper_2_odd  = rgb_upper_2 & 0b11000111000111000111000111000111;
        uint32_t rgb_lower_2_even = rgb_lower_2 & 0b00111000111000111000111000111000;
        uint32_t rgb_lower_2_odd  = rgb_lower_2 & 0b11000111000111000111000111000111;

        // パラレルで同時に送信する6bit分のRGB成分(画面の上半分と下半分)が隣接するように纏める。
        uint32_t rgb_even_1 = (rgb_lower_1_even    ) + (rgb_upper_1_even >> 3);
        uint32_t rgb_odd_1  = (rgb_lower_1_odd << 3) + (rgb_upper_1_odd      );
        uint32_t rgb_even_2 = (rgb_lower_2_even    ) + (rgb_upper_2_even >> 3);
        uint32_t rgb_odd_2  = (rgb_lower_2_odd << 3) + (rgb_upper_2_odd      );

        d32[len32 * 0] = yys[TRANSFER_PERIOD_COUNT-1];
        d32[len32 * 1] = yys[0];
        int32_t i = 1;
        do
        {
          uint32_t odd_2 = rgb_odd_2 & 0x3F;
          uint32_t odd_1 = rgb_odd_1 & 0x3F;
          uint32_t even_2 = rgb_even_2 & 0x3F;
          uint32_t even_1 = rgb_even_1 & 0x3F;
          rgb_odd_2 >>= 6;
          rgb_odd_1 >>= 6;
          odd_2 += yys[i] + (odd_1 << 16);
          // 奇数番ビット成分を横２列ぶん同時にバッファにセットする
          d32[++i * len32] = odd_2;
          even_2 += yys[i] + (even_1 << 16);
          rgb_even_2 >>= 6;
          rgb_even_1 >>= 6;
          // 偶数番ビット成分を横２列ぶん同時にバッファにセットする
          d32[++i * len32] = even_2;
        } while (i <= TRANSFER_PERIOD_COUNT);

        ++d32;

        if (++x < xe) { continue; }
        if (light_idx == TRANSFER_PERIOD_COUNT) break;
        do {
          // PIN B Discharge+
          yys[++light_idx + 1] |= (_cfg.address_mode == config_t::address_binary) ? _mask_oe : ( _mask_pin_b_lat | _mask_oe);
          xe = brightness_period[light_idx] >> 1;
        } while (x >= xe);
      }
// lgfx::gpio_hi(15);

      // 無データ,点灯のみの期間の先頭の点灯防止処理
      d32[0 - len32] |= _mask_oe;
      d32[1 - len32] |= (brightness_period[TRANSFER_PERIOD_COUNT-1] & 1) ? (_mask_oe & ~0xFFFF) : _mask_oe;

      d32 += len32;

      // SHIFTREG_ABCのY座標情報をセット;
      d32[- (y + 1                      )] |= _mask_pin_c_dat;
      d32[- (y + 1 + (panel_height >> 1))] |= _mask_pin_c_dat;
      d32[ - 1] |= _mask_lat | _mask_pin_b_lat;

      d32 += len32;
      // データのラッチ及びラッチ直後の点灯防止処理
      for (int i = 0; i < TRANSFER_PERIOD_COUNT; ++i)
      {
        d32[len32 * i - 1] |= _mask_lat;
        d32[len32 * i + 0] |= _mask_oe;
        d32[len32 * i + 1] |= (brightness_period[i] & 1) ? (_mask_oe & ~0xFFFF) :  _mask_oe;
      }

      // 作画中に次の割込みが発生した場合はビジー状態が続くことを回避するため処理をスキップする
      ulTaskNotifyTake( pdTRUE, 0);
    }
  }
//*/
//----------------------------------------------------------------------------
 }
}

#endif
#endif
